In [19]:
import pandas as pd

In [13]:
#Q1
'''read_csv(): This function is used to read data from a CSV file and create a DataFrame.
head(): This function returns the first few rows of a DataFrame. By default, it displays the first five rows.
describe(): This function generates summary statistics of the numerical columns in a DataFrame, such as count, mean, standard deviation, minimum, and maximum values.
groupby(): This function is used to group data based on one or more columns. It allows you to perform operations on specific groups or calculate aggregate statistics for each group.
fillna(): This function is used to fill missing values in a DataFrame with a specified value or a calculated value based on a given method.'''

# Read a CSV file and create a DataFrame
#df = pd.read_csv('abc.csv')

# Display the DataFrame
#print(df)

# Create a DataFrame
data = {'Name': ['John', 'Alice', 'Bob', 'Lisa', 'Mike'],
        'Age': [25, 28, 30, 32, 27],
        'City': ['New York', 'London', 'Paris', 'Sydney', 'Toronto']}
df2 = pd.DataFrame(data)

# Display the first three rows of the DataFrame
print(df2.head(3))


df3 = pd.DataFrame(data)

# Generate summary statistics of the numerical column 'Age'
print(df3['Age'].describe())



df4 = pd.DataFrame(data)

# Group the data by the 'City' column and calculate the average age for each city
grouped_data = df4.groupby('City')['Age'].mean()
print(grouped_data)



import numpy as np

# Create a DataFrame with missing values
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [6, np.nan, 8, 9, 10],
        'C': [11, 12, 13, np.nan, 15]}
df5 = pd.DataFrame(data)

# Fill missing values with the mean of each column
df5_filled = df5.fillna(df5.mean())
print(df5_filled)

    Name  Age      City
0   John   25  New York
1  Alice   28    London
2    Bob   30     Paris
count     5.000000
mean     28.400000
std       2.701851
min      25.000000
25%      27.000000
50%      28.000000
75%      30.000000
max      32.000000
Name: Age, dtype: float64
City
London      28.0
New York    25.0
Paris       30.0
Sydney      32.0
Toronto     27.0
Name: Age, dtype: float64
     A      B      C
0  1.0   6.00  11.00
1  2.0   8.25  12.00
2  3.0   8.00  13.00
3  4.0   9.00  12.75
4  5.0  10.00  15.00

In [14]:
#Q2
DataFrame = {'A':[1,2,3],
            'B':[4,5,6],
            'C':[7,8,9]}
df = pd.DataFrame(DataFrame,index = [1,3,5])
print(df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [15]:
#Q3
DataFrame = {'Values':[10, 20, 30, 40, 50]}
df = pd.DataFrame(DataFrame)
df_sum = df.head(3)
df_sum.sum()

Values    60
dtype: int64

In [29]:
#Q4
DataFrame = {'Text':['My name is Vaibhav','I study in IIT Mandi','I am a Civil Engineer of IIT Mandi','Indian Institute Of Technology Mandi']}
df = pd.DataFrame(DataFrame)
df['Word_Count']=df['Text'].apply(lambda x: len(x.split()))
df

                                   Text  Word_Count
0                    My name is Vaibhav           4
1                  I study in IIT Mandi           5
2    I am a Civil Engineer of IIT Mandi           8
3  Indian Institute Of Technology Mandi           5

In [6]:
#Q5
DataFrame = {'A':[1,2,3],
            'B':[4,5,6],
            'C':[7,8,9]}
df = pd.DataFrame(DataFrame)
print(df.size)   # due to 3 row and 3 column so 3*3 = 9 output
print(df.shape)  # it shows 3 row and 3 column

9
(3, 3)

In [7]:
#Q6
#pd.read_excel()

In [17]:
#Q7

df = pd.DataFrame({'Email':['vaibhav@gmail.com','narayan@gmail.com','john@gmail.com']})
df['Username']=df['Email'].apply(lambda x: x.split('@')[0])
df

               Email Username
0  vaibhav@gmail.com  vaibhav
1  narayan@gmail.com  narayan
2     john@gmail.com     john

In [32]:
#Q8
df1 = pd.DataFrame({'A':[3,8,6,2,9],
                   'B':[5,2,9,3,1],
                   'C':[1,7,4,5,2]})
selected_rows = df1[(df1['A'] > 5) & (df1['B'] < 10)]
print(selected_rows)
new_DataFrame = pd.DataFrame(selected_rows)
new_DataFrame

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [8]:
#Q9
df = pd.DataFrame({'Values':[10, 20, 30, 40, 50]})
mean = df.mean()
median = df.median()
std_dev = df.std()
print(mean)
print(median)
print(std_dev)

Values    30.0
dtype: float64
Values    30.0
dtype: float64
Values    15.811388
dtype: float64

In [11]:
#Q10
df = pd.DataFrame({'Sales':[10, 20, 30, 40, 50,60,70,80,90,100]})
df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
df

   Sales  MovingAverage
0     10           10.0
1     20           15.0
2     30           20.0
3     40           25.0
4     50           30.0
5     60           35.0
6     70           40.0
7     80           50.0
8     90           60.0
9    100           70.0

In [38]:
#Q11
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df['Weekday'] = pd.to_datetime(df['Date']).dt.day_name()
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [ ]:
#Q12
df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime if needed
start_date = pd.to_datetime('2023-01-01')
end_date = pd.to_datetime('2023-01-31')
mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
selected_rows = df[mask]
selected_rows

In [ ]:
#Q13
import pandas as pd